print(5+5) # 10
print('a'+'b') # ab
print(5-3) # 2
print(5*5) # 25
print("la"*5) # lalalalala
print(10**3) # 10^3,即1000
print(13/3) # 非整除
print(13//3) # 整除，向下取整至最接近的整数。
print(-13//3) # 例如 -3.14取-4，3.14取3
print(13%3) # 返回除法后的余数
print(-25.5/2.25)
print(-25.5%2.25)
print(2 << 2) #左移：右加0，位数不变
print(2 >> 2) #右移：左加0，位数不变，超出位数省略
print(2 & 2) # 按位与：按位与是针对二进制数的操作，指将两个二进制数的每一位都进行比较，如果两个相应的二进位都为 1 则此位为 1，否则为 0。
print(5|2) # 按位或：指将两个二进制数的每一位都进行比较，如果两个相应的二进位有一个为 1 则此位为 1，否则为 0。
print(6^3) # 按位异或:指将两个二进制数的每一位都进行比较，如果两个相应的二进位不同则此位为 1，相同为 0。
print(~3) # x 的按位取反结果为 -(x+1)。


